#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.db.random_password.master_password[0]: Refreshing state... [id=none]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b1543f92c5397fb3]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/walrus/upgrade]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=walrus-20220522021357134400000001]
data.aws_availability_zones.available: Reading...
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/walrus/postgresql]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=rds-monitoring-role]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-045e2073a2941e5a3]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00bc479290f40aa08]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-025adafa141f5c430]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ce877ea3dc549fbd]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05c1138bcfc764596]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03dbafad051f84b77]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07ae3feedf6adbf86]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c9f436e891e75eb4]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bbadf421d9ba7083]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-02a8de384520d175b]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-002750f72385f5949]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-033f63d9b7ed2003f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-033aba250477dcf29]
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0bdb6152121bdff35]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=rds-monitoring-role-20220522020958737700000003]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03dbafad051f84b771080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08c247a9fb74f009a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a99034757ed83a5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03373b4c21a3ce9c8]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-017244bbba4face45]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-07ec54632aec475cb]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0890c8b9bebb9f34f]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0386e5c2eadff773e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0070052ea1ae823e8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02a5856553bd31056]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a5cc4458fb5fd873]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-033aba250477dcf291080289494]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-715892711]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"] has changed
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/rds/instance/walrus/postgresql"
        name              = "/aws/rds/instance/walrus/postgresql"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"] has changed
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/rds/instance/walrus/upgrade"
        name              = "/aws/rds/instance/walrus/upgrade"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "walrus"
      + db_subnet_group_name                  = "dev-vpc"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "walrus"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.small"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::503785885773:role/rds-monitoring-role"
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "walrus-20220522021357134400000001"
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }
      + timezone                              = (known after apply)
      + username                              = "postgresqladmin"
      + vpc_security_group_ids                = [
          + "sg-0bdb6152121bdff35",
        ]

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @csepulveda, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*